# Part 1

The file "Purchase_Data.csv" contains purchase data at a Chinese supermarket for various products.  Read this csv into a dataframe called df_data and use the head() method to check that you have read in the data correctly. Make sure you import pandas.

In [38]:
import pandas as pd

df_data = pd.read_csv("Data/Purchase_Data.csv")
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Use the dtypes attribute to view how each column is stored

In [6]:
#Write your code here
df_data.dtypes

invoice_number    float64
invoice_time       object
store_id           object
product_id          int64
category_id         int64
num_item          float64
price             float64
dtype: object

Slice the first two columns using .loc and store the result in a variable called result_1.

In [39]:
#Write you code here
result_1 = df_data.loc[:, "invoice_number":"invoice_time"]
result_1

      invoice_number   invoice_time
0       2.020000e+11  7/15/15 10:45
1       2.020000e+11  7/15/15 12:16
2       2.020000e+11  7/15/15 12:16
3       2.020000e+11  7/15/15 12:16
4       2.020000e+11  7/15/15 12:16
...              ...            ...
5377    2.020000e+11   9/5/15 23:07
5378    2.020000e+11   9/5/15 23:23
5379    2.020000e+11   9/5/15 23:24
5380    2.020000e+11   9/5/15 23:32
5381    2.020000e+11   9/5/15 23:38

[5382 rows x 2 columns]

Slice the first two rows using .loc and store the result in a variable called result_2.

In [40]:
#Write you code here
result_2 = df_data.loc[0:1, :]
result_2

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0

Slice the first four rows and the first five columns and store the result in a variable called result_3.

In [41]:
#Write your code here
result_3 = df_data.loc[0:3, "invoice_number":"category_id"]
result_3

   invoice_number   invoice_time store_id  product_id  category_id
0    2.020000e+11  7/15/15 10:45     G816     7000300       210101
1    2.020000e+11  7/15/15 12:16     G816     7070884        70203
2    2.020000e+11  7/15/15 12:16     G816     7070884        70203
3    2.020000e+11  7/15/15 12:16     G816     7070891        70401

Slice rows 0,4,6 and columns invoice time and price and store the result in variable called result_4.

In [42]:
#Write your code here
result_4 = df_data.loc[[0,4,6],["invoice_time","price"]]
result_4

    invoice_time  price
0  7/15/15 10:45    2.0
4  7/15/15 12:16    6.0
6  7/15/15 15:28    2.0

Store the number rows in a variable called num_rows.

In [13]:
#Write your code here
number_rows = df_data.shape[0]

Print out the last row of the data to dataframe. **Hint:** use the variable num_rows from the previous exercise.

In [37]:
#Write your code here
number_rows

5382

# Part 2

Compute the average and max price charged.  Store the results in variables called avg_price and max_price

In [16]:
#Write your code here
average_price = df_data.price.mean()
max_price = df_data.price.max()

Compute the average price and average number of items purchased with only a single call to the mean() method. Store these averages in avg_price and avg_num_items.

In [17]:
#Write you code here
average_price, average_num_items = df_data[['price', 'num_item']].mean()

Create a column called "total", which is the product of the price and num_item columns.

In [18]:
#Write your code here
df_data['total'] = df_data['price'] * df_data['num_item']

What is the avgerage price of the three most expensive purchases?

In [20]:
#Write your code here
sorted_df = df_data.sort_values(by="total", ascending=False)
top_three_expensive = sorted_df.head(3)
average_price_top_three_expensive = top_three_expensive["total"].mean()
average_price_top_three_expensive

164.0

How many different products are there?

In [21]:
#Write your code here
unique_values = df_data["product_id"].unique()
len(unique_values)

53

Find the difference between the mean and median of the column total.  Use the describe() method and then index the dataframe it returns.

In [22]:
#Write your code here
summary_stats = df_data['total'].describe()
diff = summary_stats['mean'] - summary_stats['50%']
diff

0.9318078781127839

Use the drop() method to delete the column total from the dataframe df_data.

In [23]:
#Write your code here
df_data.drop("total", axis=1, inplace=True)
df_data.head()

,invoice_number,invoice_time,store_id,product_id,category_id,num_item,price
0,2.020000e+11,7/15/15 10:45,G816,7000300,210101,1.0,2.0
1,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
2,2.020000e+11,7/15/15 12:16,G816,7070884,70203,1.0,2.0
3,2.020000e+11,7/15/15 12:16,G816,7070891,70401,1.0,6.0
4,2.020000e+11,7/15/15 12:16,G816,7090363,70401,1.0,6.0

Let's dig a little deeper into the data set and answer some basic question.

In [1]:
#Write your code here

First, covert the column invoice time to a datetime column. Print out the new column types to make sure this was done correctly

In [24]:
#Write your code here
df_data['invoice_time'] = pandas.to_datetime(df_data['invoice_time'], format='%m/%d/%y %H:%M')

Next, let's create columns called "DOW" and "Month", which store the corresponding weekday and month of the invoice respectively.  Print the head of the dataframe to make sure this was done correctly.

In [25]:
#Write your code here
day_name_mapping = {
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
}

df_data['DOW'] = df_data['invoice_time'].dt.dayofweek.map(day_name_mapping)
df_data['Month'] = df_data['invoice_time'].dt.month_name()

Create a variable called num_purchases_wed, which stores the number of purchases made on Wednesday?  You should use value_counts and then index the series it return.

In [26]:
#Write your code here
day_counts = df_data['DOW'].value_counts()
num_purchases_wed = day_counts['Wednesday']
num_purchases_wed

959

# Part 3

In this set of practice exercises, we will be working with a demographic data regarding the passengers aboard the Titanic.  Read in the data frame and use the head() method to check that it was read in correctly.

In [27]:
#Write your code here
import pandas as pd
df_titanic = pd.read_csv('Data/Titanic.csv')
df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Use the rename method to change the column "Name" to "Passenger_Name" and the column "Ticket" to "Ticket_Num".

In [28]:
#Write your code here
df_titanic = df_titanic.rename(columns={'Name': 'Passenger_Name', 'Ticket': 'Ticket_Num'})
df_titanic.head()

,PassengerId,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Change the index of the df_titanic to the column PasengerID.

In [29]:
#Write your code here
df_titanic = df_titanic.set_index('PassengerId')
df_titanic.head()

,Pclass,Passenger_Name,Sex,Age,SibSp,Parch,Ticket_Num,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

Select the name of passenger 896

In [30]:
#Write your code here
passenger_896_name = df_titanic.loc[896, 'Passenger_Name']
passenger_896_name

'Hirvonen, Mrs. Alexander (Helga E Lindqvist)'

Change the index back to row numbers but making sure that we don't lose the PassengerId column.

In [31]:
#Write your code here
df_titanic.reset_index(inplace=True)

How many missing entries are there in the Age column? Use the isnull() method and recall than Booleans are exactly like 1s (True) and 0s (False).

In [32]:
#Write you code here
missing_age_count = df_titanic['Age'].isnull().sum()
missing_age_count

86

Compute the avg age of passengers ignoring the missing data.

In [33]:
#Write your code here
avg_age = df_titanic['Age'].mean()
avg_age

30.272590361445783

Using the fillna() method replace the missing values in the Age column with the mean.

In [36]:
#Write your code here
df_titanic['Age'].fillna(avg_age, inplace=True)

What is the average age of the 5 oldest passengers? The reset_index method will be helpful here.

In [35]:
#Write your code here
avg_age_oldest_5 = df_titanic.nlargest(5, 'Age')['Age'].mean()
avg_age_oldest_5

67.0